"""
凡是涉及到操作数的问题，我们都需要考虑以下的边界条件
1.+ -
2.数字越界 [-2^31,2^31-1]
3.把原来的数反转过来
"""
# 1.sign
string = 0
sign = -1 if string < 0 else 1

# 2.数字越界, int -> [-2^31,2^31-1]
res = 0
if res >= (1 << 31) - 1: pass

# 3.数字反转,res把个位让出，x把个位填入
x = 321
res = 0
while x != 0:
    res = res * 10 + x % 10
    x //= 10

# 4.字符串处理
    # 4.1把字符串的空格去掉
    a = "        bb"
    a.strip()
    a = "bb"

    # 4.2把字符串进行切割
    a = "a b c"
    a.split(" ")
    a = ["a", "b", "c"]

# 5字符串转数字
char = ord("9") - ord("0")

# 6检查字符串是否为数字
char.isdight()

#66,67,2都涉及到了进位的知识
"""
67的做法感觉比较通用，用个carry来储存进位的值
67,2可以用同一套写法来做
"""



